/**
 * 常量关联数组资源文件
 */

/*钞箱状态*/
var caseStatusMap = {"-1":"未启用","0":"启用","1":"已装填","20":"出库待审核","2":"已出库/已交接",
					"30":"虚拟签收待审核","3":"已虚拟签收","4":"已落地","50":"尾箱回收待审核",
					"5":"已尾箱回收","60":"入库待审核","6":"已入库/已交接", "7":"纸币已回收",
					"8":"损坏", "9":"维修", "10":"报废"};

/*钞箱袋状态*/
var bagStatusMap = {"-1":"未启用", "0":"启用", "20":"出库待审核", "2":"已出库", "50":"尾箱回收待审核", "5":"尾箱回收", "60":"入库待审核", "6":"已入库"};

/*条码状态*/
var barcodeStatusMap = {"0":"未启用", "1":"启用", "2":"停用"};

/*任务单状态*/
var dispatchStatusMap = {"1":"未分配人员", "2":"待审批", "3":"审批通过", "4":"退回调整", "5":"已取消", "6":"已过期"};

/*维护任务单状态*/
var MaintainTaskStatusMap = {"0":"未执行", "1":"执行中", "2":"已取消", "3":"已过期", "4":"已完成"};

/*维护任务单类型*/
var MaintainTaskTypeMap={"1":"卡钞", "2":"钞箱故障", "3":"通讯故障", "4":"凭条打印机故障", "5":"读卡器故障", "6":"出钞模块故障", "7":"紧急送卡", "8":"现场报修", "9":"密码键盘故障", "10":"其它故障", "11":"巡检维护", "12":"死机", "13":"废钞箱满"};						 

/*维护任务单种类*/
var MaintainTaskCatalogMap={"1":"日常类", "2":"故障类"};

/*维护任务单是否使用库车*/
var isUseCarMap = {"0":"不使用", "1":"使用"};

/*清机星期*/
var weekDayMap = {"1":"周一", "2":"周二", "3":"周三", "4":"周四", "5":"周五", "6":"周六", "7":"周日", "0":"周日" };

/*清机时段*/
var timeIntervalMap = {"1":"上午", "2":"下午", "3":"上下午", "4":"晚上"};

/*钞箱类型*/
var caseTypeMap = {"0":"循环箱", "1":"回收箱", "2":"废钞箱", "3":"存款箱", "4":"取款箱"};

/*钞箱面值*/
var caseValueMap = {"0":"100" ,"1":"50" ,"2":"20" ,"3":"10" ,"4":"5"};

/*钞箱币种*/
var caseCurrencyMap = {"CNY":"人民币", "USD":"美元"};

/*验收任务单明细状态*/
var checkTaskDetailStatusMap = {"0":"已验收", "1":"已寄库", "2":"已关联加钞任务", "3":"已过期"};

/*设备状态*/
var devStatusMap = {"1":"启用", "2":"停用", "3":"审批", "4":"正常", "5":"警告", "6":"故障", "7":"关机", "8":"撤销"};

/*日常维护类型*/
var dailyMaintainTypeMap={"1":"卡钞", "2":"钞箱故障", "3":"通讯故障", "4":"凭条打印机故障", "5":"读卡器故障", "6":"出钞模块故障", "7":"紧急送卡", "8":"现场报修", "9":"密码键盘故障", "10":"其它故障", "11":"巡检维护", "12":"死机", "13":"废钞箱满"};

/*日常维护种类*/
var dailyMaintainCatalogMap={"1":"日常类", "2":"故障类"};

/*标签类型*/
var tagTypeMap = {"1":"钞箱", "2":"钞箱袋" , "3":"设备"};

/*标签状态*/
var tagStatusMap = {"0":"未启用", "1":"启用", "2":"停用"};

/*读写器类型*/
var tagReaderTypeMap = {"1":"固定式", "2":"手持式", "3":"发卡器"};

/*读写器状态*/
var tagReaderStatusMap = {"1":"未领用", "2":"已申请", "3":"已领用", "4":"已遗失", "5":"已损坏"};

/*任务单生成方式*/
var dispatchAddModeMap = {"0":"手动", "1":"自动"};

/*钥匙状态*/
var keyStatusMap = {"0":"已停用","1":"未分配","2":"已分配", "4":"已领用", "5":"已遗失", "6":"已损坏"};

/*钥匙使用范围*/
var keyUseRangeMap = {"1":"服务站", "2":"网点", "3":"设备"};

/*钥匙性质（是否备用）*/
var keyPropertyMap = {"0":"正常", "1":"备用 "};

/*钥匙串状态*/
var keyGroupStatusMap = {"1":"未分配", "2":"已分配", "4":"已领用", "5":"整体遗失", "6":"有子钥匙遗失", "7":"有子钥匙损坏"};

/*钞袋流转类型*/
var bagCirculDetailTypeMap = {"1":"计划", "2":"备用", "3":"空钞袋"};

/*钞袋流转数据来源*/
var bagCirculDetailDataSrcType = {"1":"加钞任务单", "2":"验收任务单", "3":"其它"};

/*加钞任务明细扩展数据来源*/
var dispatchDetailExpandSrvType = {"1":"验收任务单", "2":"补录"};

/*钞袋流转数据异常标识*/
var bagCirculDetailExFlag = {"0":"正常", "1":"领错异常", "2":"流转异常"};

/*加钞任务单紧急 标识*/
var dispatchUrgentFlag = {"0":"正常任务", "1":"紧急任务"};

/*角色级别，catalog*/
var roleCatalogMap = {"1":"超级操作员", "2":"预设操作员", "3":"其它操作员"};

/*月份*/
var monthNameMap = {"1":"一月", "2":"二月", "3":"三月", "4":"四月", "5":"五月", "6":"六月", "7":"七月", 
		"8":"八月", "9":"九月", "10":"十月", "11":"十一月", "12":"十二月"};

/*网点类型*/
var netpointTypeMap = {"1":"仅一台设备", "2":"多台设备(无加钞间)", "3":"自助银行(有加钞间)", "4":"地铁有人"};

/*钥匙领用状态*/
var keyUseStatusMap = {"0":"已分配", "2":"已领用", "4":"部分归还", "5":"完全归还"};

/*钥匙领用级别*/
var keyUseCrashFlagMap = {"0":"正常", "1":"紧急"};

/*钥匙是否代领*/
var keyUseIsReplaceMap = {"0":"非代领", "1":"代领"};

/*日结单之是否加钞*/
var dailyStatementIsAddMap = {"0":"已加钞", "1":"未加钞"};

/*网点矩阵类型*/
var matrixTypeMap={"-1":"所有类型","0":"网点→网点","1":"清机中心→网点","2":"网点→清机中心"};
/*网点矩阵策略*/
var matrixTacticMap={"-1":"所有策略","0":"距离短","1":"时间短","2":"不走高速"};
/*网点矩阵点类型*/
var matrixPointTypeMap={"0":"清机中心","1":"网点"};

/*设备加钞规则执行状态*/
var devRuleExecMap = {"0":"未执行", "1":"执行中", "2":"过期无效", "3":"已取消"};
/*设备离行在行标志*/
var awayFlagMap ={"1":"在行自助服务区", "2":"单机离行自助服务点(自营)", "3":"离行自助银行(自营)－非银亭", "4":"离行自助银行(自营)－银亭", "5":"单机离行自助服务点(联营)", "6":"离行自助银行(联营)－非银亭", "7":"离行自助银行(联营)－银亭", "8":"单机在行自助服务点"};
/*设备模块故障名称*/
var modNameMap = {"IDC":"读卡器故障", "CHK":"支票读扫描故障", "PBK":"存折故障", "PIN":"密码键盘故障", "SIU":"传感器故障", "DEP":"信封存款故障", "CAM":"照相机故障", "CIM":"存款故障", "CDM":"取款故障", "SPR":"结单打印机故障", "RPR":"凭条打印机故障", "JPR":"日志打印机故障", "TTU":"文本终端故障"};
